## Example of how to use data frame

In [ ]:
import pandas as pd
data={
    'Name': ['Nash','Noor','Nin','Fas'],
    'Age': [21,22,10,50],
    'Country': ['IND','UK','Africa','China']
}
df= pd.DataFrame(data) 
print(df)

   Name  Age Country
0  Nash   21     IND
1  Noor   22      UK
2   Nin   10  Africa
3   Fas   50   China

## Column wise Indexing

In [46]:
df["Name"]

0    Nash
1    Noor
2     Nin
3     Fas
Name: Name, dtype: object

In [47]:
df[["Name","Age"]]

   Name  Age
0  Nash   21
1  Noor   22
2   Nin   10
3   Fas   50

## Row-wise indexing

In [48]:
df.iloc[0]

Name       Nash
Age          21
Country     IND
Name: 0, dtype: object

In [49]:
print(df.iloc[0][0])
print(df.iloc[0][1])
print(df.iloc[0]["Country"])

Nash
21
IND

/var/folders/5k/r1jzzvg14mv99c4n8f6zd7pc0000gn/T/ipykernel_73578/483043972.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.iloc[0][0])
/var/folders/5k/r1jzzvg14mv99c4n8f6zd7pc0000gn/T/ipykernel_73578/483043972.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.iloc[0][1])

## Filtering

In [50]:
print(df[df["Name"]=="Nash"])
print("########################")
print(df[df["Age"]>20])
print("########################")
print(df[df["Country"].isin(["IND"])])
print("########################")
print(df[(df["Country"]=="IND") & (df["Age"]>20)])

   Name  Age Country
0  Nash   21     IND
########################
   Name  Age Country
0  Nash   21     IND
1  Noor   22      UK
3   Fas   50   China
########################
   Name  Age Country
0  Nash   21     IND
########################
   Name  Age Country
0  Nash   21     IND

## Updating

In [51]:
df['Age']=df['Age']+5
print(df)
df['Country'=="IND"]="India"
print(df)
df.loc[df["Name"]=="Nash","Name"]="Nashid"
print(df)

   Name  Age Country
0  Nash   26     IND
1  Noor   27      UK
2   Nin   15  Africa
3   Fas   55   China
   Name  Age Country  False
0  Nash   26     IND  India
1  Noor   27      UK  India
2   Nin   15  Africa  India
3   Fas   55   China  India
     Name  Age Country  False
0  Nashid   26     IND  India
1    Noor   27      UK  India
2     Nin   15  Africa  India
3     Fas   55   China  India

## Deleting

In [52]:
df=df.drop(0)
df

   Name  Age Country  False
1  Noor   27      UK  India
2   Nin   15  Africa  India
3   Fas   55   China  India

## Clean up data

In [53]:
df.dropna()
df.fillna({"Name":"No Name"},inplace=True)
df

   Name  Age Country  False
1  Noor   27      UK  India
2   Nin   15  Africa  India
3   Fas   55   China  India

## Data Analysis

In [56]:
print(df["Country"].value_counts())
print("###########################")
print(df["Age"].mean()) 
print("###########################")
print(df.groupby("Country")["Age"].sum())

Country
UK        1
Africa    1
China     1
Name: count, dtype: int64
###########################
32.333333333333336
###########################
Country
Africa    15
China     55
UK        27
Name: Age, dtype: int64

## To save modified data to a csv file

In [58]:
df.to_csv("modified.csv",index=False)
df.to_csv("modified_withindex.csv",index=True)